tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
bool readInt64Param(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool hasParam(const char* name) {
  return Esp32BaseWeb::hasParam(name);
}

bool readInt64ParamOptional(const char* name, int64_t& out) {
  char raw[24];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return true;
  }
  char* end = nullptr;
  const long long value = strtoll(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<int64_t>(value);
  return true;
}

bool readUint32Param(const char* name, uint32_t& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam(name, raw, sizeof(raw))) {
    return false;
  }
  char* end = nullptr;
  const unsigned long value = strtoul(raw, &end, 10);
  if (!end || *end != '\0') {
    return false;
  }
  out = static_cast<uint32_t>(value);
  return true;
}

bool readUint32ParamOptional(const char* name, uint32_t& out) {
  return !Esp32BaseWeb::hasParam(name) || readUint32Param(name, out);
}

int64_t openTargetPulsesFromTurnsX100(int64_t turnsX100) {
  return (kDefaultOutputPulsesPerRev * turnsX100) / 100;
}

int64_t turnsX100FromOpenTargetPulses(int64_t openTargetPulses) {
  return (openTargetPulses * 100) / kDefaultOutputPulsesPerRev;
}

int64_t defaultMaxRunPulsesForTarget(int64_t openTargetPulses) {
  return (openTargetPulses * 150) / 100;
}

bool readTrustLevelParam(PositionTrustLevel& out) {
  char raw[16];
  if (!Esp32BaseWeb::getParam("trustLevel", raw, sizeof(raw))) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Trusted") == 0 || strcmp(raw, "trusted") == 0) {
    out = PositionTrustLevel::Trusted;
    return true;
  }
  if (strcmp(raw, "Limited") == 0 || strcmp(raw, "limited") == 0) {
    out = PositionTrustLevel::Limited;
    return true;
  }
  if (strcmp(raw, "Untrusted") == 0 || strcmp(raw, "untrusted") == 0) {
    out = PositionTrustLevel::Untrusted;
    return true;
  }
  return false;
}

void applyRuntimeConfigFromBase() {
#if ESP32BASE_ENABLE_APP_CONFIG
  const int32_t speedPercent = Esp32BaseConfig::getInt("door", "speed", 60);
  const int32_t openTurnsX100 = Esp32BaseConfig::getInt("door", "openTurns", 500);
  const int32_t maxRunMs = Esp32BaseConfig::getInt("door", "maxRunMs", 25000);
  const bool requestedCurrentGuard =
      Esp32BaseConfig::getBool("door", "currentGuard", false);

  if (speedPercent >= 10 && speedPercent <= 100) {
    g_motorProfile.speedPercent = static_cast<uint8_t>(speedPercent);
  }
  if (openTurnsX100 > 0) {
    g_doorConfig.openTargetPulses = openTargetPulsesFromTurnsX100(openTurnsX100);
    g_doorConfig.maxRunPulses = defaultMaxRunPulsesForTarget(g_doorConfig.openTargetPulses);
    g_motorProtection.maxRunPulses = g_doorConfig.maxRunPulses;
  }
  if (maxRunMs > 0) {
    g_doorConfig.maxRunMs = static_cast<uint32_t>(maxRunMs);
    g_motorProtection.maxRunMs = g_doorConfig.maxRunMs;
  }
  const DoorSnapshot snapshot = g_door.snapshot();
  if (snapshot.state != DoorState::Opening && snapshot.state != DoorState::Closing) {
    g_door.configure(g_doorConfig);
  }
  g_currentGuard.enabled = ina240CompileEnabled() && requestedCurrentGuard;
#else
  g_currentGuard.enabled = false;
#endif
}

DoorRecordTime currentRecordTime() {
  DoorRecordTime time;
#if ESP32BASE_ENABLE_NTP
  const Esp32BaseNtp::TimeSnapshot snapshot = Esp32BaseNtp::snapshot();
  time.unixTime = snapshot.synced ? snapshot.epochSec : 0;
  time.uptimeSec = snapshot.uptimeSec;
  time.bootId = snapshot.bootId;
#endif
  return time;
}

#if ESP32BASE_ENABLE_FS
bool appendDoorRecordBytes(const char* path, const uint8_t* data, std::size_t length, void*) {
  return Esp32BaseFs::appendBytes(path, data, length);
}

bool doorRecordPathExists(const char* path, void*) {
  return Esp32BaseFs::exists(path);
}

int64_t doorRecordFileSize(const char* path, void*) {
  return Esp32BaseFs::fileSize(path);
}

bool removeDoorRecordFile(const char* path, void*) {
  return Esp32BaseFs::removeFile(path);
}

bool renameDoorRecordFile(const char* from, const char* to, void*) {
  return Esp32BaseFs::rename(from, to);
}

bool readDoorRecordBytesAt(const char* path,
                           uint32_t offset,
                           uint8_t* out,
                           std::size_t maxLength,
                           std::size_t* readLength,
                           void*) {
  return Esp32BaseFs::readBytesAt(path, offset, out, maxLength, readLength);
}

bool ensureRecordStorageReady() {
  if (g_recordStorageReady) {
    return true;
  }
  if (!Esp32BaseFs::isReady()) {
    return false;
  }
  if (!Esp32BaseFs::exists(kDoorRecordRootDir) && !Esp32BaseFs::mkdir(kDoorRecordRootDir)) {
    return false;
  }
  if (!Esp32BaseFs::exists(kDoorRecordDir) && !Esp32BaseFs::mkdir(kDoorRecordDir)) {
    return false;
  }
  g_recordStorageReady = true;
  return true;
}
#endif

void recordBusinessEvent(const DoorRecord& record) {
  const DoorRecord stored = g_records.append(record, currentRecordTime());
#if ESP32BASE_ENABLE_FS
  if (!ensureRecordStorageReady()) {
    return;
  }
  const DoorRecordRotateResult rotateResult =
      rotateDoorRecordPathIfNeeded(kDoorRecordCurrentPath,
                                   kDoorRecordMaxCurrentBytes,
                                   kDoorRecordMaxArchives,
                                   kDoorRecordEncodedMaxBytes,
                                   doorRecordFileSize,
                                   doorRecordPathExists,
                                   removeDoorRecordFile,
                                   renameDoorRecordFile,
                                   nullptr);
  if (rotateResult != DoorRecordRotateResult::Ok) {
    ESP32BASE_LOG_W("farmdoor", "record_rotate_failed result=%u",
                    static_cast<unsigned>(rotateResult));
  }
  const DoorRecordWriteResult result = appendDoorRecordToPath(
      stored, kDoorRecordCurrentPath, appendDoorRecordBytes, nullptr);
  if (result != DoorRecordWriteResult::Ok) {
    ESP32BASE_LOG_W("farmdoor", "record_append_failed result=%u",
                    static_cast<unsigned>(result));
  }
#endif
}

void sendRecordJson(const DoorRecord& record) {
  Esp32BaseWeb::sendChunk("{\"sequence\":");
  sendUint32(record.sequence);
  Esp32BaseWeb::sendChunk(",\"unixTime\":");
  sendUint32(record.unixTime);
  Esp32BaseWeb::sendChunk(",\"uptimeSec\":");
  sendUint32(record.uptimeSec);
  Esp32BaseWeb::sendChunk(",\"bootId\":");
  sendUint32(record.bootId);
  Esp32BaseWeb::sendChunk(",\"eventType\":\"");
  Esp32BaseWeb::sendChunk(recordTypeName(record.type));
  Esp32BaseWeb::sendChunk("\",\"result\":\"");
  Esp32BaseWeb::sendChunk(recordResultName(record.result));
  Esp32BaseWeb::sendChunk("\",\"command\":\"");
  Esp32BaseWeb::sendChunk(commandName(record.command));
  Esp32BaseWeb::sendChunk("\",\"oldPositionPulses\":");
  sendInt64(record.oldPositionPulses);
  Esp32BaseWeb::sendChunk(",\"newPositionPulses\":");
  sendInt64(record.newPositionPulses);
  Esp32BaseWeb::sendChunk(",\"oldTravelPulses\":");
  sendInt64(record.oldTravelPulses);
  Esp32BaseWeb::sendChunk(",\"newTravelPulses\":");
  sendInt64(record.newTravelPulses);
  Esp32BaseWeb::sendChunk(",\"deltaPulses\":");
  sendInt64(record.deltaPulses);
  Esp32BaseWeb::sendChunk("}");
}

