tangyangguang/FarmAuto/apps/Esp32FarmDoor/src/FarmDoorApp.cpp
void FarmDoorApp::configureHardwareInputs() {
  FarmDoorHw.begin(FarmDoorHardwarePins{});
}

void FarmDoorApp::configureStaticDefaults() {
  g_motorHardware.driverType = Esp32EncodedDcMotor::DriverType::At8236HBridge;
  g_motorHardware.pwmFrequencyHz = 20000;
  g_motorHardware.pwmResolutionBits = 8;
  g_motorHardware.ledcChannelA = 0;
  g_motorHardware.ledcChannelB = 1;

  g_encoderBackend.backendType = Esp32EncodedDcMotor::EncoderBackendType::Pcnt;
  g_encoderBackend.pinA = FarmDoorHw.pins().encoderA;
  g_encoderBackend.pinB = FarmDoorHw.pins().encoderB;
  g_encoderBackend.countMode = Esp32EncodedDcMotor::CountMode::X1;

  g_motorKinematics.motorShaftPulsesPerRev = 16;
  g_motorKinematics.gearRatio = 131.0f;
  g_motorKinematics.outputPulsesPerRev = kDefaultOutputPulsesPerRev;
  g_motorKinematics.countMode = Esp32EncodedDcMotor::CountMode::X1;

  g_motorProfile.speedPercent = 60;
  g_motorProfile.softStartMs = 1000;
  g_motorProfile.softStopMs = 500;
  g_motorProfile.minEffectiveSpeedPercent = 15;

  g_motorProtection.startupGraceMs = 1000;
  g_motorProtection.maxRunMs = 25000;
  g_motorProtection.maxRunPulses = kDefaultMaxRunPulses;

  g_motorStopPolicy.emergencyOutputMode = Esp32EncodedDcMotor::EmergencyOutputMode::Coast;

  g_currentSensor.adcPin = FarmDoorHw.pins().currentAdc;
  g_currentSensor.amplifierGain = 50.0f;
  g_currentSensor.senseResistorMilliOhm = 5.0f;
  g_currentSensor.bidirectional = true;

#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  g_currentGuard.enabled = false;  // 软件支持已接入；实测校准前默认不启用保护动作。
#else
  g_currentGuard.enabled = false;
#endif
  g_currentGuard.warningThresholdMa = 1800;
  g_currentGuard.faultThresholdMa = 2500;
  g_currentGuard.startupGraceMs = 1000;

  g_recordStoreConfig.layoutVersion = 1;
  g_recordStoreConfig.baseAddress = 0;
  g_recordStoreConfig.totalBytes = 16 * 1024;
  g_recordStoreConfig.pageSize = 64;

  g_doorConfig.closedPositionPulses = 0;
  g_doorConfig.openTargetPulses = kDefaultOpenTargetPulses;
  g_doorConfig.maxRunPulses = kDefaultMaxRunPulses;
  g_doorConfig.maxRunMs = g_motorProtection.maxRunMs;
  const DoorCommandResult doorConfigResult = g_door.configure(g_doorConfig);
  if (doorConfigResult != DoorCommandResult::Ok) {
    ESP32BASE_LOG_E("farmdoor", "door_config_failed result=%u", static_cast<unsigned>(doorConfigResult));
  }
}

void FarmDoorApp::configureAppConfigPage() {
#if ESP32BASE_ENABLE_APP_CONFIG
  Esp32BaseAppConfig::setTitle("Esp32FarmDoor 参数");
  Esp32BaseAppConfig::setChangeCallback(onAppConfigChange);
  Esp32BaseAppConfig::addGroup({"motor", "电机"});
  Esp32BaseAppConfig::addGroup({"protection", "保护"});
  Esp32BaseAppConfig::addGroup({"current", "电流检测"});

  Esp32BaseAppConfig::addInt({"motor", "door", "speed", "运行速度", 60, 10, 100, 5, "%",
                              "普通开门/关门速度。", false, nullptr});
  Esp32BaseAppConfig::addDecimal({"motor", "door", "openTurns", "开门目标", 500, 0, 2000, 5, 2,
                                  "圈", "开门目标圈数，可由校准流程更新。", false, nullptr});
  Esp32BaseAppConfig::addInt({"protection", "door", "maxRunMs", "最大运行时长", 25000, 1000,
                              120000, 1000, "ms", "保底停止边界。", false, nullptr});
  Esp32BaseAppConfig::addBool({"current", "door", "currentGuard", "启用 INA240A2", false,
                               "GPIO33 电流检测，实测稳定后启用。", false, nullptr});
#endif
}

void FarmDoorApp::configureBusinessShell() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::setDeviceName("Esp32FarmDoor");
  Esp32BaseWeb::setHomePath("/");
  Esp32BaseWeb::setHomeMode(Esp32BaseWeb::HOME_APP);
  Esp32BaseWeb::setSystemNavMode(Esp32BaseWeb::SYSTEM_NAV_BOTTOM);
  Esp32BaseWeb::addNavItem("/", "首页");
  Esp32BaseWeb::addNavItem("/records", "记录");
  Esp32BaseWeb::addNavItem("/calibration", "校准");
  Esp32BaseWeb::addNavItem("/diagnostics", "诊断");
  Esp32BaseWeb::addPage("/", "自动门首页", FarmDoorApp::sendHomePage);
  Esp32BaseWeb::addPage("/records", "自动门记录", FarmDoorApp::sendRecordsPage);
  Esp32BaseWeb::addPage("/calibration", "行程校准", FarmDoorApp::sendCalibrationPage);
  Esp32BaseWeb::addPage("/diagnostics", "自动门诊断", FarmDoorApp::sendDiagnosticsPage);
  Esp32BaseWeb::addApi("/api/app/status", FarmDoorApp::sendStatusJson);
  Esp32BaseWeb::addApi("/api/app/diagnostics", FarmDoorApp::sendDiagnosticsJson);
  Esp32BaseWeb::addApi("/api/app/events/recent", FarmDoorApp::sendRecentEventsJson);
  Esp32BaseWeb::addApi("/api/app/records", FarmDoorApp::sendRecordsJson);
  Esp32BaseWeb::addApi("/api/app/door/open", FarmDoorApp::handleDoorOpen);
  Esp32BaseWeb::addApi("/api/app/door/close", FarmDoorApp::handleDoorClose);
  Esp32BaseWeb::addApi("/api/app/door/stop", FarmDoorApp::handleDoorStop);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-position", FarmDoorApp::handleSetPosition);
  Esp32BaseWeb::addApi("/api/app/maintenance/set-travel", FarmDoorApp::handleSetTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/adjust-travel", FarmDoorApp::handleAdjustTravel);
  Esp32BaseWeb::addApi("/api/app/maintenance/clear-fault", FarmDoorApp::handleClearFault);
#endif
}

void FarmDoorApp::sendHomePage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::sendHeader("自动门首页");
  Esp32BaseWeb::sendChunk("<h1>自动门首页</h1><section><h2>门状态与操作</h2><table>");
  Esp32BaseWeb::sendChunk("<tr><th>状态</th><td>");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("</td></tr><tr><th>当前位置</th><td>");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(" 脉冲</td></tr><tr><th>开门目标</th><td>");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(" 脉冲</td></tr><tr><th>位置可信度</th><td>");
  Esp32BaseWeb::sendChunk(trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendChunk("</td></tr></table><p>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/open'><button>开门</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/close'><button>关门</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/door/stop'><button>停止</button></form>");
  Esp32BaseWeb::sendChunk("</p></section><section><h2>快速入口</h2><p>");
  Esp32BaseWeb::sendChunk("<a href='/calibration'>行程校准</a> ");
  Esp32BaseWeb::sendChunk("<a href='/records'>业务记录</a> ");
  Esp32BaseWeb::sendChunk("<a href='/diagnostics'>业务诊断</a>");
  Esp32BaseWeb::sendChunk("</p></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendRecordsPage() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::sendHeader("自动门记录");
  Esp32BaseWeb::sendChunk("<h1>记录</h1><section><h2>业务记录查询</h2>");
  Esp32BaseWeb::sendChunk("<form method='get' action='/api/app/records'>");
  Esp32BaseWeb::sendChunk("<label>开始序号 <input name='start' value='0'></label> ");
  Esp32BaseWeb::sendChunk("<label>每页 <input name='limit' value='16'></label> ");
  Esp32BaseWeb::sendChunk("<label>事件类型 <input name='eventType' placeholder='DoorTravelSet'></label> ");
  Esp32BaseWeb::sendChunk("<button>查询 JSON</button></form>");
  Esp32BaseWeb::sendChunk("</section><section><h2>最近事件</h2>");
  Esp32BaseWeb::sendChunk("<p><a href='/api/app/events/recent'>查看最近事件 JSON</a></p></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendCalibrationPage() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::sendHeader("行程校准");
  Esp32BaseWeb::sendChunk("<h1>校准</h1><section><h2>当前位置</h2><table>");
  Esp32BaseWeb::sendChunk("<tr><th>当前位置</th><td>");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(" 脉冲</td></tr><tr><th>开门目标</th><td>");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(" 脉冲</td></tr><tr><th>每圈信号数</th><td>");
  sendInt64(g_motorKinematics.outputPulsesPerRev);
  Esp32BaseWeb::sendChunk("</td></tr></table></section><section><h2>端点标定</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/set-position'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='position' value='closed'><button>把当前位置标为关门基准</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/set-position'>");
  Esp32BaseWeb::sendChunk("<input type='hidden' name='position' value='open'><button>把当前位置标为开门位置</button></form>");
  Esp32BaseWeb::sendChunk("</section><section><h2>行程调整</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/set-travel'>");
  Esp32BaseWeb::sendChunk("<label>开门目标 0.01 圈 <input name='openTurnsX100' value='500'></label> ");
  Esp32BaseWeb::sendChunk("<button>设置行程</button></form>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/adjust-travel'>");
  Esp32BaseWeb::sendChunk("<label>微调 0.01 圈 <input name='deltaTurnsX100' value='5'></label> ");
  Esp32BaseWeb::sendChunk("<button>微调行程</button></form></section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendDiagnosticsPage() {
#if ESP32BASE_ENABLE_WEB
  Esp32BaseWeb::sendHeader("自动门诊断");
  Esp32BaseWeb::sendChunk("<h1>诊断</h1><section><h2>业务诊断</h2>");
  Esp32BaseWeb::sendChunk("<p><a href='/api/app/diagnostics'>查看诊断 JSON</a></p>");
  Esp32BaseWeb::sendChunk("<p><a href='/api/app/status'>查看状态 JSON</a></p>");
  Esp32BaseWeb::sendChunk("</section><section><h2>故障处理</h2>");
  Esp32BaseWeb::sendChunk("<form method='post' action='/api/app/maintenance/clear-fault'><button>清除业务故障</button></form>");
  Esp32BaseWeb::sendChunk("</section>");
  Esp32BaseWeb::sendFooter();
#endif
}

void FarmDoorApp::sendStatusJson() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  Esp32BaseWeb::beginJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"firmware\":\"");
  Esp32BaseWeb::writeJsonEscaped(Esp32Base::firmwareVersion());
  Esp32BaseWeb::sendChunk("\",\"schemaVersion\":1,");
  Esp32BaseWeb::sendChunk("\"state\":\"");
  Esp32BaseWeb::sendChunk(stateName(snapshot.state));
  Esp32BaseWeb::sendChunk("\",\"activeCommand\":\"");
  Esp32BaseWeb::sendChunk(commandName(snapshot.activeCommand));
  Esp32BaseWeb::sendChunk("\",\"position\":{\"pulses\":");
  sendInt64(snapshot.positionPulses);
  Esp32BaseWeb::sendChunk(",\"percent\":");
  sendUint32(positionPercent(snapshot));
  Esp32BaseWeb::sendChunk(",\"trustLevel\":\"");
  Esp32BaseWeb::sendChunk(trustName(snapshot.positionTrustLevel));
  Esp32BaseWeb::sendChunk("\",\"source\":\"");
  Esp32BaseWeb::sendChunk(snapshot.positionTrustLevel == PositionTrustLevel::Untrusted ? "NotCalibrated" : "Runtime");
  Esp32BaseWeb::sendChunk("\"},\"travel\":{\"closedPulses\":");
  sendInt64(snapshot.closedPositionPulses);
  Esp32BaseWeb::sendChunk(",\"openTargetPulses\":");
  sendInt64(snapshot.openTargetPulses);
  Esp32BaseWeb::sendChunk(",\"outputPulsesPerRev\":");
  sendInt64(kDefaultOutputPulsesPerRev);
  Esp32BaseWeb::sendChunk(",\"maxRunPulses\":");
  sendInt64(g_doorConfig.maxRunPulses);
  Esp32BaseWeb::sendChunk(",\"maxRunMs\":");
  sendUint32(g_doorConfig.maxRunMs);
  Esp32BaseWeb::sendChunk("},\"lastStopReason\":\"");
  Esp32BaseWeb::sendChunk(stopReasonName(snapshot.lastStopReason));
  Esp32BaseWeb::sendChunk("\",\"faultReason\":\"");
  Esp32BaseWeb::sendChunk(faultReasonName(snapshot.faultReason));
  Esp32BaseWeb::sendChunk("\",");
  Esp32BaseWeb::sendChunk("\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"enabled\":");
  Esp32BaseWeb::sendChunk(g_currentGuard.enabled ? "true" : "false");
  Esp32BaseWeb::sendChunk("},\"motor\":{\"driver\":\"AT8236\",\"encoderMode\":\"X1\"}}");
  Esp32BaseWeb::endJson();
#endif
}

void FarmDoorApp::sendDiagnosticsJson() {
#if ESP32BASE_ENABLE_WEB
  const FarmDoorReadOnlyDiagnostics diagnostics = FarmDoorHw.readDiagnostics();

  Esp32BaseWeb::beginJson(200);
  Esp32BaseWeb::sendChunk("{\"appKind\":\"FarmDoor\",");
  Esp32BaseWeb::sendChunk("\"mode\":\"readOnlyDiagnostics\",");
  Esp32BaseWeb::sendChunk("\"buttons\":{");
  sendDigitalField("aux", diagnostics.buttonAux);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("open", diagnostics.buttonOpen);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("close", diagnostics.buttonClose);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("stop", diagnostics.buttonStop);
  Esp32BaseWeb::sendChunk("},\"encoder\":{");
  sendDigitalField("a", diagnostics.encoderA);
  Esp32BaseWeb::sendChunk(",");
  sendDigitalField("b", diagnostics.encoderB);
  Esp32BaseWeb::sendChunk("},\"currentSensor\":{\"chip\":\"INA240A2\",\"adcPin\":33,\"rawAdc\":");
  char number[16];
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAdc);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMin\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMin);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawMax\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawMax);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"rawAvg\":");
  snprintf(number, sizeof(number), "%d", diagnostics.currentRawAvg);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"sampleCount\":");
  snprintf(number, sizeof(number), "%u", diagnostics.currentSampleCount);
  Esp32BaseWeb::sendChunk(number);
  Esp32BaseWeb::sendChunk(",\"compileEnabled\":");
#if FARMAUTO_FARMDOOR_ENABLE_INA240A2
  Esp32BaseWeb::sendChunk("true");
#else
  Esp32BaseWeb::sendChunk("false");
#endif
  Esp32BaseWeb::sendChunk(",\"runtimeEnabled\":");
  Esp32BaseWeb::sendChunk(boolJson(g_currentGuard.enabled));
  Esp32BaseWeb::sendChunk("},\"at24c\":{\"address\":\"0x50\",\"online\":");
  Esp32BaseWeb::sendChunk(boolJson(diagnostics.at24cOnline));
  Esp32BaseWeb::sendChunk(",\"storeReady\":");
  Esp32BaseWeb::sendChunk(boolJson(g_at24cStoreReady));
  Esp32BaseWeb::sendChunk("},\"motorOutput\":{\"enabled\":false}}");
  Esp32BaseWeb::endJson();
#endif
}

void FarmDoorApp::sendRecentEventsJson() {
#if ESP32BASE_ENABLE_WEB
  sendRecordSnapshotJson("ram");
#endif
}

void FarmDoorApp::sendRecordsJson() {
#if ESP32BASE_ENABLE_WEB
  DoorRecordQuery query;
  uint32_t limitParam = query.limit;
  if (!readUint32ParamOptional("start", query.startIndex) ||
      !readUint32ParamOptional("limit", limitParam) ||
      !readUint32ParamOptional("startUnixTime", query.startUnixTime) ||
      !readUint32ParamOptional("endUnixTime", query.endUnixTime) || limitParam == 0 ||
      limitParam > kDoorRecordPageMaxRecords) {
    sendCommandResultJson(DoorCommandResult::InvalidArgument);
    return;
  }
  query.limit = static_cast<uint8_t>(limitParam);
  char eventType[32];
  if (Esp32BaseWeb::getParam("eventType", eventType, sizeof(eventType)) && eventType[0] != '\0') {
    if (!doorRecordTypeFromName(eventType, query.type)) {
      sendCommandResultJson(DoorCommandResult::InvalidArgument);
      return;
    }
    query.typeFilterEnabled = true;
  }

  Esp32BaseWeb::beginJson(200);
#if ESP32BASE_ENABLE_FS
  DoorRecordPage page;
  const DoorRecordReadResult readResult = readDoorRecordPage(kDoorRecordCurrentPath,
                                                             query,
                                                             doorRecordFileSize,
                                                             readDoorRecordBytesAt,
                                                             nullptr,
                                                             page);
  if (readResult == DoorRecordReadResult::Ok && page.totalRecords > 0) {
    Esp32BaseWeb::sendChunk("{\"source\":\"flash\",\"start\":");
    sendUint32(page.startIndex);
    Esp32BaseWeb::sendChunk(",\"nextIndex\":");
    sendUint32(page.nextIndex);
    Esp32BaseWeb::sendChunk(",\"limit\":");
    sendUint32(limitParam);
    Esp32BaseWeb::sendChunk(",\"count\":");
    sendUint32(page.count);
    Esp32BaseWeb::sendChunk(",\"totalRecords\":");
    sendUint32(page.totalRecords);
    Esp32BaseWeb::sendChunk(",\"recordBytes\":");
    sendUint32(kDoorRecordEncodedMaxBytes);
    Esp32BaseWeb::sendChunk(",\"records\":[");
    for (uint8_t i = 0; i < page.count; ++i) {
      if (i > 0) {
        Esp32BaseWeb::sendChunk(",");
      }
      sendRecordJson(page.records[i]);
    }
    Esp32BaseWeb::sendChunk("]}");
    Esp32BaseWeb::endJson();
    return;
  }
#endif

  const DoorRecordSnapshot snapshot = g_records.snapshot();
  Esp32BaseWeb::sendChunk("{\"source\":\"ram\",\"start\":0,\"limit\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"count\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"totalRecords\":");
  sendUint32(snapshot.count);
  Esp32BaseWeb::sendChunk(",\"capacity\":");
  sendUint32(kDoorRecentRecordCapacity);
  Esp32BaseWeb::sendChunk(",\"records\":[");
  for (uint8_t i = 0; i < snapshot.count; ++i) {
    if (i > 0) {
      Esp32BaseWeb::sendChunk(",");
    }
    sendRecordJson(snapshot.records[i]);
  }
  Esp32BaseWeb::sendChunk("]}");
  Esp32BaseWeb::endJson();
#endif
}

void FarmDoorApp::handleDoorOpen() {
#if ESP32BASE_ENABLE_WEB
  const DoorCommandResult result = g_door.requestOpen();
  DoorRecord record;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Open;
  record.newTravelPulses = g_door.snapshot().openTargetPulses;
  recordBusinessEvent(record);
  sendCommandResultJson(result);
#endif
}

void FarmDoorApp::handleDoorClose() {
#if ESP32BASE_ENABLE_WEB
  const DoorCommandResult result = g_door.requestClose();
  DoorRecord record;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Close;
  recordBusinessEvent(record);
  sendCommandResultJson(result);
#endif
}

void FarmDoorApp::handleDoorStop() {
#if ESP32BASE_ENABLE_WEB
  const DoorSnapshot snapshot = g_door.snapshot();
  const DoorCommandResult result = g_door.requestStop(snapshot.positionPulses);
  DoorRecord record;
  record.type = DoorRecordType::CommandRequested;
  record.result = doorRecordResultFromCommand(result);
  record.command = DoorCommand::Stop;
  record.oldPositionPulses = snapshot.positionPulses;
  record.newPositionPulses = g_door.snapshot().positionPulses;
  recordBusinessEvent(record);
  if (result == DoorCommandResult::Ok) {
    persistDoorRecoveryStateIfReady();
  }
  sendCommandResultJson(result);
#endif
}

